app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @movies = Movie.order(sort_params)

INSERT INTO "movies" ("title", "length", "release_year", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Alpha"], ["length", 34], ["release_year", 3421], ["rating", 132], ["created_at", "2015-10-01 20:23:31.242599"], ["updated_at", "2015-10-01 20:23:31.242599"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save